# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
user_input = int(input('Введите номер буквы в алфавите: '))
print(f'Это буква - {chr(user_input+ 96)}')
